# Brewfile - macOS app manifest
# Install: brew bundle install
# Update:  brew bundle dump --force (regenerate from installed)

# ----------------------------
# Taps
# ----------------------------
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# ----------------------------
# CLI Tools
# ----------------------------
brew "chezmoi"        # Dotfiles manager
brew "tmux"           # Terminal multiplexer
brew "neovim"         # Editor
brew "git"            # Version control
brew "gh"             # GitHub CLI
brew "node"           # Node.js (for LSPs, Claude Code)
brew "ripgrep"        # Fast grep (for Telescope)
brew "fd"             # Fast find (for Telescope)
brew "fzf"            # Fuzzy finder
brew "jq"             # JSON processor

# ----------------------------
# Fonts
# ----------------------------
cask "font-meslo-lg-nerd-font"

# ----------------------------
# Terminals
# ----------------------------
cask "alacritty"      # GPU-accelerated terminal
cask "warp"           # AI-powered terminal

# ----------------------------
# Browsers
# ----------------------------
cask "arc"            # Modern browser
cask "google-chrome"  # Backup browser

# ----------------------------
# Development
# ----------------------------
cask "cursor"         # AI code editor
cask "docker"         # Containers
cask "postman"        # API testing
cask "pgadmin4"       # PostgreSQL GUI
cask "linear-linear"  # Project management

# ----------------------------
# Productivity
# ----------------------------
cask "raycast"        # Launcher (replaces Spotlight)
cask "obsidian"       # Notes (local markdown)
cask "notion"         # Notes (cloud)
cask "figma"          # Design

# ----------------------------
# Communication
# ----------------------------
cask "slack"          # Team chat
cask "zoom"           # Video calls
cask "loom"           # Async video

# ----------------------------
# Passwords (pick your main one)
# ----------------------------
cask "1password"
cask "dashlane"
cask "bitwarden"

# ----------------------------
# Manual installs (not in Homebrew)
# ----------------------------
# - Granola: https://granola.so/download
# - Claude Code: npm install -g @anthropic-ai/claude-code
